export const DB_PATH = {
    // 根节点路径映射
    ROOT: {
        STAT_DATA: '',
        ASSET_MANAGER: '资产',
        WAREHOUSE: '资产.仓库',
        ASSETS: '资产.资产总览',
        NPCS: '关系列表',
        BACKPACK: '主角.背包',
        // 主角数据比较散，定义具体位置
        PLAYER_BASE: '主角',
        PLAYER_SKILLS: '主角.技能',
        PLAYER_ATTRS: '主角.属性',
        PLAYER_EQUIP: '主角.装备',     // <--- 如果以后装备移到了 '角色.装备'，只改这里即可
        PLAYER_GOD: '主角.登神长阶',
        POSITION: '世界.地点'
    },
    // 属性键名映射
    KEY: {
        //通用?
        QUALITY: '品质',
        POS: '位置',
        QTY: '数量',
        TYPE: '类型',
        TAG: '标签',
        DESC: '描述',
        EFFECT: '效果',
        COST: '消耗',
        SKILLS: '技能',
        EQUIPMENT: '装备',
        BACKPACK: '背包',
        STATUS: '状态效果',
        ATTRIBUTES: '属性',
        LEVEL: "等级",


        //命定之人属性
        NPC_IS_PRESENT: '在场',
        NPC_IS_CONTRACT: '命定契约',
        NPC_LIFE_LEVEL: '生命层级',
        NPC_LEVEL: '等级',
        NPC_RACE: '种族',
        NPC_IDENTITY: '身份',
        NPC_PROFESSION: '职业',
        NPC_PERSONALITY: '性格',
        NPC_LIKES: '喜爱',
        NPC_APPEARANCE: '外貌',
        NPC_CLOTHING: '着装',
        NPC_EQUIPMENT: '装备',
        NPC_ATTRIBUTES: '属性',
        NPC_GODPATH: '登神长阶',
        NPC_FRIENDSHIP: '好感度',
        NPC_COMMENT: '心里话',
        NPC_BACKGROUNDSTORY: '背景故事',
        NPC_SKILL: '技能',
        NPC_BACKPACK: '背包',

        //技能属性
        SKILL_QUALITY: '品质',
        SKILL_TYPE: '类型',
        SKILL_COST: '消耗',
        SKILL_TAG: '标签',
        SKILL_DESC: '描述',
        SKILL_EFFECT: '效果',

        //物品属性
        //ITEM_NAME: '名称', // 虽然通常作为Key使用，但也可能作为属性
        ITEM_QUALITY: '品质',
        ITEM_QTY: '数量',
        ITEM_TYPE: '类型',
        ITEM_TAG: '标签',
        ITEM_DESC: '描述',
        ITEM_EFFECT: '效果',
        ITEM_POS: '位置',

        //角色属性
        PLAYER_LEVEL: '等级',
        PLAYER_LIFE_LEVEL: '生命层级',
        PLAYER_RACE: '种族',
        PLAYER_IDENTITY: '身份',
        PLAYER_PROFESSION: '职业',
        PLAYER_ATTRIBUTES: '属性',
        PLAYER_MAXMP: "法力值上限",
        // ... 把代码里用到的字符串都列在这里
    }
};
export const mockCharRuntime = {
    stats: { "str": 13, "dex": 13, "con": 13, "int": 21, "wis": 13, "mythic_rank": 10, "classLevels": { "mythic_angel": 25 }, "level": 25, "str_vitality": 13, "dex_vitality": 13, "con_vitality": 13, "int_vitality": 21, "wis_vitality": 13, "str_mod": 13, "dex_mod": 13, "con_mod": 13, "int_mod": 21, "wis_mod": 13, "cha_mod": 10, "initiative": 5, "alchemy_rolls": 15, "resist_fire": 30, "extra_attack": 2, "ac_standard": 13, "ac_touch": 13, "ac_flat_footed": 0, "ac": 13, "max_hp": 0 },
    interceptors: {"onBeforeAttackRoll":[{"hook":"onBeforeAttackRoll","desc":"看破史诗级以下的幻术","context":{"sourceBuff":"主角_真理之瞳"}},{"hook":"onBeforeAttackRoll","desc":"攻击可以穿透掩体生效","context":{"sourceBuff":"主角_静默·休止符"}}],"onDefend":[{"hook":"onDefend","desc":"[绝对守护]: 当你或任何被设定的“守护目标”即将受到一次判定为“致命”的攻击时，该技能将自动触发，无视任何控制与封锁效果，将你们三人强制传送至最近的、预设的安全道标点。该自动效果拥有24小时的冷却时间。","context":{"sourceBuff":"主角_应急空间道标"}},{"hook":"onDefend","desc":"[法则拒绝]: 每场战斗开始生成具有10000点血量的护盾。存在护盾时免疫所有负面效果，减免15%的伤害\n[熵逆转]: 当护盾承受单次超过生命上限20%的伤害时，有50%几率将溢出伤害转化为自身的MP","context":{"sourceBuff":"主角_悖论之御·绝对界限"}}],"onAlchemyRolls":[{"hook":"onAlchemyRolls","desc":"全知工匠: 在进行任何【制造】或【解析】判定时，必定不会出现“大失败”。\n虚空铸造: 无需材料凭空具现传说及以下物品（及生物组织），传说以下炼金必定成功。","context":{"sourceBuff":"主角_真理铸型_·_万物编码"}},{"hook":"onAlchemyRolls","desc":"【真理加护】所有制造/炼金检定的DC永久-10。\n主动【虚空造物】制造传说及以下物品时，无需材料且必定成功。制造【神话】品质物品时，检定结果+20且必定不会大失败\n【主动 · 归零分解】消耗[动作]与3000 MP。对物品：将其瞬间还原为最原始的材料状态。若用于自身炼金失败时，可无损回收所有材料。","context":{"sourceBuff":"主角_物质"}}]},
    statsLogs: {
    "bab": {
        "_setBase": [
            {
                "sourceId": "base_progression",
                "value": 0,
                "isActive": false
            },
            {
                "sourceId": "base_progression",
                "value": 0,
                "isActive": false
            },
            {
                "sourceId": "base_progression",
                "value": 0,
                "isActive": false
            }
        ],
        "_additions": {},
        "_multipliers": [],
        "_locks": []
    },
    "initiative": {
        "_setBase": [],
        "_additions": {
            "untyped": {
                "activeTotal": 5,
                "records": [
                    {
                        "value": 5,
                        "sourceId": "战斗本能",
                        "sourceType": "skill",
                        "directSourceId": "主角_战斗本能",
                        "directSourceType": "buff",
                        "isActive": true
                    }
                ]
            }
        },
        "_multipliers": [],
        "_locks": []
    },
    "alchemy_rolls": {
        "_setBase": [],
        "_additions": {
            "untyped": {
                "activeTotal": 15,
                "records": [
                    {
                        "value": 15,
                        "sourceId": "真理铸型 · 万物编码",
                        "sourceType": "skill",
                        "directSourceId": "主角_真理铸型_·_万物编码",
                        "directSourceType": "buff",
                        "isActive": true
                    }
                ]
            }
        },
        "_multipliers": [],
        "_locks": []
    },
    "resist_fire": {
        "_setBase": [],
        "_additions": {
            "untyped": {
                "activeTotal": 30,
                "records": [
                    {
                        "value": 30,
                        "sourceId": "神话血脉 · 终焉龙座",
                        "sourceType": "skill",
                        "directSourceId": "主角_神话血脉_·_终焉龙座",
                        "directSourceType": "buff",
                        "isActive": true
                    }
                ]
            }
        },
        "_multipliers": [],
        "_locks": []
    },
    "extra_attack": {
        "_setBase": [],
        "_additions": {
            "haste": {
                "activeTotal": 2,
                "records": [
                    {
                        "value": 2,
                        "sourceId": "万法之墙·虚空礼赞",
                        "sourceType": "equipment",
                        "directSourceId": "主角_万法之墙·虚空礼赞",
                        "directSourceType": "buff",
                        "isActive": true
                    }
                ]
            }
        },
        "_multipliers": [],
        "_locks": []
    },
    "ac": {
        "_setBase": [],
        "_additions": {
            "dexterity": {
                "activeTotal": 13,
                "records": [
                    {
                        "sourceId": "base_dex",
                        "sourceType": "attribute",
                        "value": 13,
                        "isActive": true
                    }
                ]
            }
        },
        "_multipliers": [],
        "_locks": []
    }
}
};


export const mockCharData = { "种族": "", "身份": ["自由平民", "晨风炼金工坊主/米娅的老师", "龙脉者", "逻辑炼金术流派创始人", "炼金大师", "风切堡永久荣誉市民", "瓦伦蒂亚家族战略盟友", "异端裁决所临时执行官", "真理之锁技术顾问", "伯伦斯法环名誉长老", "伯伦斯法环荣誉首席顾问"], "职业": [], "生命层级": "第七层级/登神", "等级": 25, "累计经验值": 401840, "升级所需经验": "MAX", "冒险者等级": "未评级", "属性点": 16, "属性": { "力量": 13, "敏捷": 13, "体质": 13, "智力": 21, "精神": 13 }, "生命值上限": 41600, "生命值": 39600, "法力值上限": 136000, "法力值": 78000, "体力值上限": 104000, "体力值": 78500, "状态效果": {}, "金钱": 73815000, "背包": { "《原土启蒙：剥离尘世的十三步》": { "品质": "史诗", "类型": "书籍", "数量": 1, "标签": [], "效果": { "获取知识": "获得技能仪式炼金术" }, "描述": "描述精密的书籍，记录了一大堆知识" }, "劣等治疗药水（甜浆果风味）": { "品质": "普通", "类型": "消耗品", "数量": 6, "标签": ["无"], "效果": { "效果1": "微弱生命恢复" }, "描述": "一种经过口味改良的劣等治疗药水。清甜的果香完美中和了草药的苦涩，让它尝起来更像是一款风味独特的健康饮品。它的出现，或许会让那些吝啬的冒险者重新审视“喝药”这件事。" }, "赫尔墨斯之卷：生命炼成之秘仪": { "品质": "史诗", "类型": "其它物品", "数量": 1, "标签": ["默认标签"], "效果": {}, "描述": "一本用未知黑色皮革制成的古籍，封面上烙印着衔尾蛇炼成阵。其中记载了关于'生命炼成'的禁忌知识，包括血肉强化、血脉移植，乃至人造灵魂的技术。这是触及神明领域的知识，也是一把足以毁灭世界的双刃剑。" }, "《魅魔的育儿心得》": { "品质": "稀有", "类型": "NSFW道具", "数量": 1, "标签": ["无"], "效果": {}, "描述": "一本由深渊某位魅魔女王亲笔撰写的育儿书籍（？）。里面详细记述了如何将一名普通的人类/精灵/翼民幼童，从身体到心灵一步步“培育”成合格的、只属于自己的、绝对服从的“小宠物”的全过程。内容包括但不限于：早期依赖性建立、羞耻观念改造、身体敏感点开发、特殊指令调教等一百零八个章节。书页散发着甜腻的香气。" }, "通行证汇总": { "品质": "稀有", "类型": "资格证", "数量": 1, "标签": ["无"], "效果": { "效果1": "现有：巴纳巴斯·浮士德私人炼金室的通行证，自然神殿图书馆通行印记，格林姆的锻造室钥匙，红叶镇锻造师协会最高权限徽章" }, "描述": "通往各种地区的通行证" }, "炼金大师的资格证与徽章": { "品质": "史诗", "类型": "资格证", "数量": 1, "标签": ["无"], "效果": { "权威认证": "在所有炼金术师公会及其附属机构中，你将享有最高级别的权限与待遇。", "知识之钥": "你可以无条件查阅公会图书馆内所有史诗级及以下的炼金文献与配方。", "材料优先权": "每月拥有一次优先申购史诗级炼金材料的权力。" }, "描述": "由炼金术师公会官方认证的大师凭证。徽章由秘银和星辰黑曜石打造，镶嵌着一颗巨大的蓝宝石，并雕刻着五颗耀眼的金星。它代表着持有者在炼金领域的崇高地位与权威。" }, "心绪如镜之饮": { "品质": "史诗", "类型": "消耗品", "数量": 16, "标签": ["默认标签"], "效果": { "效果1": "可以随饮用者心境变化味道。" }, "描述": "一瓶超越了味觉本身的奇迹之水。它的味道会随着饮用者心境的改变而变化万千。当你快乐时，它是香甜的蜜酒；当你悲伤时，它是微苦的清茶。它没有任何治疗或增益效果，唯一的用途，就是映照你的内心。这是炼金术抵达艺术领域的证明。" }, "金狮黑金卡": { "品质": "传说", "类型": "资格证", "数量": 1, "标签": ["无"], "效果": { "至高信誉": "持有此卡，在所有金狮商会名下的产业消费，都将享受最高级别的贵宾折扣与优先服务。", "财富之匙": "获得一个额度为五十万金币的无息信用账户。", "情报特权": "每月可向商会免费咨询三条A级及以下的商业或公开情报。", "商路通行": "可以免费使用金狮商会的所有商路与运输渠道。" }, "描述": "黄金所至，商路通达。而您，将永远走在商路的最前方。" }, "金狮至高信誉契约·磐石之章": { "品质": "传说", "类型": "其它物品", "数量": 1, "标签": ["无"], "效果": { "效果1": "一份具备最高魔法与法律效力的契约。规定了你与金狮商会关于【概念演示装置】的独家合作条款，为你带来未来相关产业10%的永久分红权。" }, "描述": "这份契约由金狮商会首席法律顾问亲自拟定，并由辉煌女神之名见证。它的每一个字都由纯粹的规则构成，坚不可摧。" }, "万象仪 V1·摄影版": { "品质": "传说", "类型": "其它物品", "数量": 1, "标签": ["无"], "效果": { "概念投影": "能够将演算核心构思或接收的任何概念（故事、战术、设计图等），以带有听觉和嗅觉的3D立体全息影像形式，投射到现实空间中。", "交互式推演": "可通过交互设备影响投影内容的走向，演算核心将根据输入进行实时的发展演算。", "自我演化": "演算核心会根据观众的交互数据进行深度学习，不断优化其故事创作与逻辑推演能力。", "永恒能源&安保协议": "内置的【微型太阳之心】能为其提供近乎无限的稳定能源，并拥有绝对安全的【跃迁保险】机制。且当机器被盗走并经过警告无果后，机器会自动传送到安全地点并在原地引爆能源核心。", "瞬间光影拓印": "新增功能，可进行高精度静态影像拍摄与三维环境扫描，生成可保存和回放的立体影像。【记忆恒久】(大成功增益)：通过本装置记录的所有影像，其数据结构将得到传说级的加固，永不褪色，永不损坏。" }, "描述": "一台由你亲手打造的、足以开启一个全新娱乐与信息时代的奇迹造物。它不再是简单的‘盒子’，而是通往无限故事与真实概念的窗口。现在，它还拥有了定格永恒的能力。" }, "清爽活力饮剂（薄荷柠檬风味）": { "品质": "普通", "类型": "消耗品", "数量": 3, "标签": ["默认标签"], "效果": { "效果1": "饮用后，在10分钟内缓慢恢复生命和法力。获得【提神醒脑】的微弱状态，精神不易疲惫。" }, "描述": "是你为感谢艾米丽特制的礼物。" }, "专利授权证书": { "品质": "史诗", "类型": "资格证", "数量": 1, "标签": ["无"], "效果": { "效果1": "证明你拥有【概念演示装置】的独家商业权利，受炼金术师公会保护。" }, "描述": "一张制作精美、边缘烫金的羊皮纸证书，上面盖着炼金术师公会总部的火漆印章。" }, "炼金专利徽章": { "品质": "稀有", "类型": "资格证", "数量": 1, "标签": ["无"], "效果": { "效果1": "佩戴时提升在炼金术师公会的声望，象征着技术权威。" }, "描述": "一枚秘银打造的徽章，呈展开的书籍形状，浮雕着齿轮与光影符文。" }, "劣等治疗药水(优良)": { "品质": "优良", "类型": "消耗品", "数量": 2, "标签": ["无"], "效果": { "效果1": "生命恢复，口感微甜" }, "描述": "米娅在你的指导下制作的第一批药水，纯度极高且带有回甘。" }, "金狮战略合作契约·天空之翼": { "品质": "史诗", "类型": "其它物品", "数量": 1, "标签": ["无"], "效果": { "效果1": "规定了晨风与金狮商会关于'天空堡垒'的合作模式。商会提供物资支持（作为预付金/贷款），晨风保留战舰所有权与指挥权，商会享有同等条件下的优先雇佣权。" }, "描述": "一份确立了未来空中霸主与商业帝国盟友关系的契约。它证明了即使是自由的苍鹰，偶尔也会需要一个歇脚的黄金枝头。" }, "瓦伦蒂亚家族霜狼徽章": { "品质": "史诗", "类型": "资格证", "数量": 1, "标签": ["无"], "效果": { "效果1": "持有者被视为瓦伦蒂亚公爵的直系/战略盟友。在北境及帝国军方拥有极高的通行权限与礼遇。可调动一定数量的北境军队协助防御。" }, "描述": "一枚由万年玄冰雕刻而成的霜狼徽章，散发着凛冽的寒气。它是北境主宰友谊的象征。" }, "便携式相位通讯器": { "品质": "传说", "类型": "其它物品", "数量": 1, "标签": ["无"], "效果": { "效果1": "与【静待之风】的相位传送系统绑定。无论身处何地（包括强干扰区），只要按下按钮，即可引导战舰智脑锁定坐标，利用天体之心撕裂空间，将持有者及周围友方单位瞬间传送回战舰内部。" }, "描述": "通往天空王座的钥匙。回家的路，就在手腕之上。" }, "群星的眼泪": { "品质": "传说", "类型": "其它物品", "数量": 1, "标签": ["无"], "效果": { "灵魂回响": "拥有特殊精神构造或灵魂本质的个体在靠近它时，会‘听’到源自星海深处的、无声的歌谣。/", "未解之谜": "其材质与内部的能量结构无法被任何已知手段解析，它独立于现行的所有物理与魔法法则之外。/", "命运绑定": "（未知效果）当你持有它时，你的命运似乎与遥远的某个存在产生了微弱的联系。" }, "描述": "一枚从“星眠之都”遗迹中发现的神秘吊坠。它不属于这个世界的任何已知文明，它的存在本身就是一个无法解答的谜题。—“我们都曾是星辰的碎片，只是忘记了如何歌唱。" }, "圣约之叶": { "品质": "稀有", "类型": "资格证", "数量": 1, "标签": ["默认标签"], "效果": { "效果1": "持有此证，可以在大教堂的图书馆借阅部分关于古代自然神学的典籍。" }, "描述": "枢机主教安德烈·瓦尔特赠送的特别赠礼。" }, "情报：群星归位的真相": { "品质": "传说", "类型": "其它物品", "数量": 1, "标签": ["知识"], "效果": { "效果1": "记录了十二星辰为外神封印点，群星归位即封印解除的过程及空洞为世界屏障缺口的信息。获得状态【直视深渊者】。" }, "描述": "从禁忌之书中获取的足以撼动世界观的真相。" }, "异端裁决所·临时执行官徽章": { "品质": "史诗", "类型": "资格证", "数量": 1, "标签": ["无"], "效果": { "效果1": "拥有处理高危目标的先斩后奏权；对黑暗生物有威慑压制。" }, "描述": "一把悬在异端头顶的达摩克利斯之剑，代表着教会最黑暗也最锋利的意志。" }, "时空观测者徽章": { "品质": "特殊", "类型": "资格证", "数量": 1, "标签": ["无"], "效果": { "效果1": "拥有随时进入真理之塔工地现场及调用相位共振熔炉的权限。" }, "描述": "一枚小巧的银色沙漏徽章，象征着萨里奥斯·时流的授权。" }, "伯伦斯法环名誉长老徽章": { "品质": "传说", "类型": "资格证", "数量": 1, "标签": ["无"], "效果": { "效果1": "拥有仅次于议长的权限，可调动法环1/3资源，拥有一票否决权。" }, "描述": "一枚雕刻着衔尾蛇与无限符号的紫金徽章，象征着魔法世界巅峰的权力与地位。" }, "皇家科学院S级金库钥匙（一次性）": { "品质": "特殊", "类型": "其它物品", "数量": 1, "标签": ["无"], "效果": { "效果1": "可开启S级战略资源库，任意挑选一件物品。" }, "描述": "一把古铜色的奇特钥匙，通往帝国最深层的底蕴。" }, "监控名单": { "品质": "传说", "类型": "其他物品", "数量": 1, "标签": ["名单"], "效果": { "效果1": "异端裁决所 · 重点监控名录", "效果2": "极危 · S级权限", "效果3": "1. 萨里奥斯·时流 (Sarios Timestream)", "效果4": "状态：等待揭密。", "效果5": "2. “血腥玛丽” (已除名)", "效果6": "3. 埃蒙·瓦尔 (Eamon Val)", "效果7": "状态：【暗中执行/忠诚】。位于瓦尔家族墓园，监视帝都局势。", "效果8": "4. 塞西莉亚·晨光 (Cecilia Dawn)", "效果9": "状态：【完全觉醒/友善】。已返回皇家剧院，准备复出。" }, "描述": "异端裁判所的重点监控名单" }, "苍籁回响·永恒席位": { "品质": "传说", "类型": "资格证", "数量": 1, "标签": ["默认标签"], "效果": { "海之礼遇": "持有者及其同伴在赛瑞利亚享有最高级别的外交豁免权与贵宾待遇，所有消费全免。", "深海传讯": "可通过此徽章直接联系爱丽丝·赛瑞利亚，无视距离限制。", "终极包厢": "无论赛瑞利亚的演出票多么紧缺，苍籁王座那间视野最好的“云端包厢”将永远为您保留。", "暴风支援": "在无尽海海域内，若持有者遭遇危机，可激活徽章，召唤最近的赛瑞利亚巡演团或深海守卫进行支援。" }, "描述": "赛瑞利亚最高级别的贵宾通行证，海之歌姬友谊的见证。" }, "深海之火": { "品质": "优良", "类型": "消耗品", "数量": 1, "标签": ["酒"], "效果": { "效果1": "极其烈性的朗姆酒，饮用后获得【微醺】与【勇猛】状态（力量+1，痛觉降低），持续1小时。" }, "描述": "巴罗萨·赤潮珍藏三十年的烈酒，据说用深海火山口附近的特殊海藻酿造，喝一口像是在吞碳。" }, "贤者的宁静（成品）": { "品质": "史诗", "类型": "消耗品", "数量": 8, "标签": ["无"], "效果": { "效果1": "饮用后，在长达4小时内持续、高效地恢复饮用者的生命力、精神力与体力，并大幅提升精神抗性，附带【深度安神】与【精神疲劳快速恢复】效果。" }, "描述": "由你亲手炼制，在功效上比巴纳巴斯的原版更胜一筹的顶级恢复药剂。瓶中液体呈现出流动的星夜景象。" }, "地下藏书馆通行印记": { "品质": "史诗", "类型": "资格证", "数量": 1, "标签": ["无"], "效果": { "效果1": "凭此可自由进出艾瑟嘉德大教堂地下藏书馆。" }, "描述": "安德烈主教特批的权限，上面有他的魔力印签。" }, "金狮商会核心股权书": { "品质": "传说", "类型": "资格证", "数量": 1, "标签": ["无"], "效果": { "效果1": "享有商会15%分红与高层投票权。" }, "描述": "这不仅是财富的源泉，更是权力的权杖" }, "凛冬之印": { "品质": "传说", "类型": "其它物品", "数量": 1, "标签": [], "效果": { "冰原通行证": "在永冻冰原持有此印，视为咏霜龙姬的宾客，所有中立/守序冰系生物不会主动攻击。可免疫神话级以下的寒冷环境伤害。" }, "描述": "艾瑞拉·霜语赠予的友谊证明，一片永不融化的雪花。" }, "被污染的狼牙": { "品质": "稀有", "类型": "材料", "数量": 1, "标签": ["空置"], "效果": { "效果1": "蕴含微量深渊毒素。" }, "描述": "变异魔狼的牙齿。" }, "深渊结晶(微粒)": { "品质": "稀有", "类型": "材料", "数量": 1, "标签": ["空置"], "效果": { "效果1": "高纯度深渊能量微粒。" }, "描述": "从魔狼体内析出的结晶。" }, "彼岸花 (极品)": { "品质": "传说", "类型": "材料", "数量": 58, "标签": ["空置"], "效果": { "效果1": "吸收了神话级亡灵气息绽放的冥界之花。蕴含纯粹的【死亡】与【记忆】要素。是制作“忘川之水”或高阶亡灵晋升仪式的核心触媒。" }, "描述": "吸收了神话级亡灵气息绽放的冥界之花。花开一千年，花落一千年，花叶永不见。那是亡者的思念，也是生者的遗憾。" }, "灰败的裹尸布": { "品质": "传说", "类型": "材料", "数量": 1, "标签": ["无"], "效果": { "效果1": "从一位远古巫妖王的坟墓中盗掘出的裹尸布。它浸透了死亡法则的气息，触碰者会感到生命力的飞速流逝。" }, "描述": "来自巫妖王的陪葬品。" }, "悖论晶体": { "品质": "传说", "类型": "材料", "数量": 1, "标签": ["空置"], "效果": { "效果1": "✦", "存在与虚无": "同时具备物质与反物质的特性，可作为连接现实与虚数空间的完美桥梁。", "效果2": "✦", "稳定悖论": "结构异常坚固，能承受法则级的空间撕裂而不崩溃。" }, "描述": "一块看起来既像固体又像液体，颜色在鲜红与死灰之间不断闪烁的诡异晶体。" }, "破碎的邪教航海图": { "品质": "史诗", "类型": "知识/情报", "数量": 1, "标签": ["情报"], "效果": { "效果1": "记录了“血腥玛丽”舰队近期在深海大漩涡外围的航线轨迹，以及几处疑似外神信仰的祭祀节点坐标。" }, "描述": "这张由人皮缝制的地图上，标注着通往疯狂的捷径。" }, "汞": { "品质": "普通", "类型": "素材", "数量": 1, "标签": [], "效果": {}, "描述": "" }, "金": { "品质": "普通", "类型": "素材", "数量": 1, "标签": [], "效果": {}, "描述": "" }, "《白月之证：梦行漫记》": { "品质": "", "类型": "书籍", "数量": 1, "标签": [], "效果": {}, "描述": "" }, "《倒影：跨越阈值的神圣联姻》": { "品质": "", "类型": "书籍", "数量": 1, "标签": [], "效果": {}, "描述": "" }, "《星轨、血脉与万物同构律》": { "品质": "", "类型": "书籍", "数量": 1, "标签": [], "效果": {}, "描述": "" }, "《刻度与火候：规范炼金操作》": { "品质": "", "类型": "书籍", "数量": 1, "标签": [], "效果": {}, "描述": "" }, "《超越之书：打破等价置换的理论方法》": { "品质": "", "类型": "书籍", "数量": 1, "标签": [], "效果": {}, "描述": "" }, "隐匿型阵列死光·设计图": { "品质": "史诗", "类型": "设计图", "数量": 1, "标签": ["知识"], "效果": { "DC锁定": "25", "前置条件": "{属性:{目标:智力,值:18}, 环境:{目标:高阶魔导实验室}}", "材料要求": "{粗略限制:{描述:[高纯度空间水晶, 极寒属性魔核]}}", "目标成品": "{名称:幽影阵列改装模块, 品质:史诗, 描述:能为大型载具提供一层相位隐匿屏障，并将其死气排放转化为冰霜射线输出的改装套件。}", "伪装帷幕": "使载具获得脱战隐形能力，免疫三层级以下肉眼与魔法探知。", "凛冬死光": "替换原有火力，开火时不再暴露死灵气息，而是转化为纯粹的冰霜射击。" }, "描述": "能为大型载具提供相位隐匿屏障，并改造其火控系统的设计图纸。" }, "贤者之石设计图": { "品质": "唯一", "类型": "设计图", "数量": 1, "标签": ["防御: 15"], "效果": { "DC锁定": "100", "前置条件": "智力大于20,  炼制时间:目标:每年最后一天和新年第一天交会点的2小时内", "材料要求": "必须有金, 汞, 粗略限制：要有罪人的灵魂,善人的灵魂，信者的灵魂", "成品效果：万物催化": "可以添加到任何制造流程中，为制造检定提供50点无类型加值", "成品效果：升华之刻": "将贤者之石注入心脏，一分钟内实力被强行提升到第七层级，随后死亡", "目标成品": "名称:贤者之石, 品质:唯一,描述:万物的催化剂，一切要素的完美升华" }, "描述": "贤者之石的设计图" }, "旅人沙漏（已融入时之轮·悖论引擎）222222222222222222222222": { "品质": "唯一", "类型": "其它物品", "数量": 1, "标签": ["无"], "效果": {}, "描述": "你愿意用什么，来换取一个重新来过的机会？" }, "时之砂·永恒回廊的钥匙": { "品质": "唯一", "类型": "材料", "数量": 1, "标签": [], "效果": {}, "描述": "巨兽体内的奇点。这不仅仅是一团能量，这是某段被“遗忘”的历史的实体化结晶。它承载着这头巨兽数千年来吞噬的所有悲欢离合。" }, "破碎的时空怀表": { "品质": "传说", "类型": "材料", "数量": 1, "标签": ["无"], "效果": { "效果1": "蕴含着极高浓度的【时间】与【怨念】双重属性。可作为核心材料制作传说级时空类装备，或通过高阶炼金术提取其中的【时间回溯】概念。" }, "描述": "提莫·齿轮的灵魂寄宿其中。它不仅是材料，更是一个幽灵的移动居所。持有它，你能听见来自十年前的呓语。" } }, "装备": { "静默·休止符": { "品质": "传说", "类型": "", "标签": ["法器", "智力", "精神", "攻击: 580"], "效果": { "静默咏唱": "施法者的意念直接干涉现实。你施放所有法术均无需吟唱，需要多回合准备的法术可以单回合内释放，且施法速度提升30%。/", "绝对寂静领域": "(主动) 消耗2000 MP。以自身或指定点为中心，展开一个半径50米的“休止符领域”。领域内强制消除一切声音与振动。所有处于领域内的敌方单位将陷入【完全沉默】状态，且每回合受到施法者精神属性x100的真实精神伤害。持续3回合。/", "精神重压": "(被动) 30米内敌人的施法专注检定全部处于劣势，且精神抗性降低15%。/", "相位穿透": "(大成功) 寂静领域具有相位属性，可穿透掩体生效。" }, "描述": "声音的终点不是消失，而是被更宏大的‘无’所吞噬。这是爱丽丝谱写的休止符，也是晨风锻造的断头台。", "位置": "主手" }, "悖论之御·绝对界限": { "品质": "传说", "类型": "", "标签": ["臂铠", "防御: 480"], "效果": { "法则拒绝": "每场战斗一次，生成具有10000点血量的护盾。护盾拥有极高的优先级，存在时免疫所有负面效果，并固定减免15%的所有伤害", "熵逆转": "当护盾承受单次超过生命上限20%的伤害时，有50%几率将溢出伤害转化为自身的MP", "双子共鸣": "(套装) 与【万法之墙】同时装备时，智力+2。" }, "描述": "在这条界线之后，是神的禁区。", "位置": "副手手臂" }, "万法之墙·虚空礼赞": { "品质": "传说", "类型": "", "标签": ["法袍", "防御: 550"], "效果": { "虚空漫步": "20%的物理/魔法闪避率。移动时不产生任何风阻与声响", "元素解构": "受到元素伤害时强制削减其50%的威力", "相位口袋": "内置独立的高维储物空间，且能让使用者在短时间内遁入亚空间规避致命一击（每日1次）。" }, "描述": "它不是衣服，它是穿在身上的空间褶皱。", "位置": "全身" }, "世界之树的祝福之叶": { "品质": "史诗", "类型": "", "标签": ["项链", "防御: 50"], "效果": { "效果1": "佩戴它，可以让你免受大部分诅咒与瘟疫的侵袭，在森林中获得自然的青睐，并加快伤势的恢复速度。" }, "描述": "一片由世界之树亲自赐福的叶子，蕴含着磅礴的生命能量。对于任何一个王国而言，它都价值连城。", "位置": "胸前" }, "母亲的安魂曲": { "品质": "史诗", "类型": "", "标签": ["项链", "防御: 0"], "效果": { "灵魂谐振": "精神抗性检定+2。", "绝对宁静": "极高几率净化负面精神状态（每日一次）。", "遗愿": "生命值首次低于10%时，触发一次性的传说级【灵魂屏障】并恢复50%HP。" }, "描述": "一份用灵魂与爱意凝结成的遗物，由稀有的“月之泪”金属打造，并融入了一位强大施法者临终前对孩子的祝福。", "位置": "颈部" }, "星隐之戒·双子星": { "品质": "传说", "类型": "", "标签": ["戒指", "防御: 150", "智力+1"], "效果": { "万象森罗": "佩戴者可以随意设定自身对外展现的生命层级（最高不超过自身当前层级）、容貌、声音与体型，并完美模拟一切能量波动与气息。", "虚空帷幕": "佩戴者将免疫所有传说级及以下的预言与探知类法术。当受到传说以上的此类法术探查时，对方有极高几率（d20≥5）获得一个由戒指随机生成的、完全错误的虚假结果。【星辰守护】(大成功增益)：戒指核心的引力场会持续扭曲佩戴者自身的命运轨迹，使其难以被锁定。", "量子纠缠": "双戒持有者之间可无视距离、位面进行实时心灵通讯，并能感知对方的生命状态。" }, "描述": "一枚将星辰藏于指间的奇迹造物。戴上它，你便是在世间行走的幽灵，是真实存在的幻影。无人能看穿你的伪装，无人能捕捉你的命运。", "位置": "右手食指" }, "人鱼之泪·珍珠项链（晨风制作）": { "品质": "稀有", "类型": "", "标签": ["项链", "防御: 15", "精神+1"], "效果": { "静心": "佩戴者更容易集中精神，进行冥想或施法时，精神消耗降低5%。" }, "描述": "由你亲手制作的珍珠项链，淡金色的珍珠中蕴含着你平和安宁的心境，是一件完美的艺术品。", "位置": "颈部" } }, "技能": { "战斗本能": { "品质": "史诗", "类型": "被动", "消耗": "", "标签": ["敏捷", "自身", "增益"], "效果": { "效果1": "在战斗中，你的反应速度、闪避率和格挡成功率获得大幅度提升。当面对突发攻击时，有一定几率自动触发【完美闪避】或【完美格挡】。" }, "描述": "你的身体仿佛活了过来，它会在你的意识反应过来之前，就对危险做出最正确的应对。" }, "三元悖论囚笼": { "品质": "史诗", "类型": "主动", "消耗": "2000 MP (初次构建)，后续维持和转化消耗 150 MP。", "标签": ["智力", "精神", "环境", "控制", "功能"], "效果": { "秩序框架": "囚笼拥有绝对的‘存在’优先度，无法被同等级及以下的空间法术穿越或破坏。", "极寒实体": "囚笼壁由蕴含【霜】要素的极寒冰晶构成，持续吸收内部热量，对火焰系单位造成压制。", "转化适应": "囚笼壁会根据内部目标的攻击属性，通过【转化】要素实时改变自身材质，获得极高的针对性抗性。" }, "描述": "融合【秩序】、【霜】、【转化】三种要素构筑的终极封印结界。在指定区域创造一个边长100米的立方体囚笼。" }, "虚数心智构建": { "品质": "史诗", "类型": "主动", "消耗": "2000 MP", "标签": ["智力", "精神", "自身", "功能"], "效果": { "效果1": "你可以在一个合适的‘载体’（如高纯度水晶）上，构建一个拥有特定情感、记忆和行为模式的‘虚数心智’。该心智并非真正的灵魂，但能够在仪式或精神交互中，完美地模拟出真实灵魂的波动，用以欺骗、引导或承受精神层面的交互。效果结束后，虚数心智将彻底消散，不留任何痕迹。" }, "描述": "融合了【生命炼成】、【灵魂嫁接】与【情感植入】的巅峰技艺。" }, "时空扭曲": { "品质": "传说", "类型": "主动", "消耗": "5000 MP / 5000 SP", "标签": ["智力", "范围:5", "控制", "增益"], "效果": { "效果1": "扭曲指定区域内的时空，你可以随意对任何目标施加时间加速或减速效果。你也可以利用扭曲的空间，进行短距离的瞬间移动。效果:", "时间加速": "自身回合结束后，有50%几率无条件获得一个额外回合。/", "时间减速": "指定一个目标，其所有行动（攻击、移动、施法）速度降低50%，所有防御检定处于劣势。" }, "描述": "时间不再是恒定的河流，而是你指尖的琴弦。" }, "恒星演化": { "品质": "传说", "类型": "主动", "消耗": "释放10000 MP / 10000 SP，维持无消耗，移动和阶段切换消耗2000 MP", "标签": ["智力", "环境", "伤害", "控制", "威力: 4000"], "效果": { "效果1": "在指定地点先后造成以下三种效果，持续时间无限，每个阶段至少维持一回合才能切换至下一阶段。", "太阳": "召唤一颗微型太阳，每回合对周围敌人造成火、光、暗混合伤害。/", "超新星": "恒星生命的最后爆发，造成【太阳】基础伤害×(2+存在回合数) 的火、光、暗混合范围伤害。/", "黑洞": "恒星内部简并压无法抵抗重力形成超高密度奇点。形成时周围敌人必须通过DC为 (20 + 施法者智力/2) 的体质豁免检定，否则被吸入黑洞视界死亡。在黑洞引力辐射范围其余空间类效果自动失效，敌人受重力异常效果，每回合自身存在被动摇，受到五次生命上限5%的真实伤害。" }, "描述": "运用【物质掌控】权能在指定地点模拟恒星的生命周期，你可随意加速或终止演化过程——宇宙在你掌握之中。" }, "信标跃迁": { "品质": "传说", "类型": "主动", "消耗": "制造信标与核心 4000 MP / 启动跃迁 8000 MP", "标签": ["智力", "范围:5", "功能"], "效果": { "效果1": "该技能由三个子技能构成：", "定位信标": "你可以将一个纯粹的空间定位信标附着在任意物体上，并将其送出。你最多可同时维持5个信标。/", "虚数演算核心": "你可以创造一个临时的、专门用于空间计算的虚数心智，并将其与【定位信标】一同送出。/", "信标跃迁": "当信标抵达目的地后，你可以启动传送。你的本体将与【虚数演算核心】进行远程协同计算，构建时空折叠路径，最终将你精准传送至信标所在位置。" }, "描述": "你对时空法则的颠覆性再创造。通过将“定位”、“计算”与“传送”功能模块化分离，你实现了理论上可以抵达任何地点的终极传送。" }, "真理之瞳": { "品质": "史诗", "类型": "被动", "消耗": "无", "标签": ["智力", "精神", "自身", "增益", "功能"], "效果": { "效果1": "你的双眼能洞悉万物的内在结构与能量流动。解析任何物品/法术/生物时，获得的信息量提升500%，且必定能发现其最核心的弱点或原理。该技能无法被任何同等级及以下的幻术或伪装所欺骗。" }, "描述": "在你的视界中，不存在秘密。" }, "生命福音": { "品质": "史诗", "类型": "主动", "消耗": "[动作: 2500 MP]", "标签": ["精神", "范围:5", "治疗", "功能"], "效果": { "效果1": "吟唱生命与成长的歌谣，为最多5名友方目标恢复巨量生命值，并净化其史诗级以下的负面状态。或，对指定区域的植物进行一次强效催生，使其在短时间内完成数月的生长过程，甚至诱发良性变异。" }, "描述": "你所到之处，便是春天。" }, "应急空间道标": { "品质": "传说", "类型": "被动", "消耗": "无", "标签": ["智力", "精神", "自身", "范围:3", "功能"], "效果": { "被动演算": "一个虚拟心智将持续在后台计算最优的空间迁跃路径。你可以通过消耗一个意念，瞬间启动一次无需准备的短距离传送，将自己与最多两名“守护目标”传送至3000米内的任意指定地点。", "绝对守护": "当你或任何被设定的“守护目标”即将受到一次判定为“致命”的攻击时，该技能将自动触发，无视任何控制与封锁效果，将你们三人强制传送至最近的、预设的安全道标点。该自动效果拥有24小时的冷却时间。" }, "描述": "一套融合了空间法则与战斗直觉的终极保险。它并非用于进攻，而是为了守护最珍贵之物，在绝境中开辟出的最后一条生路。" }, "仪式：嬗变": { "品质": "唯一", "类型": "主动", "消耗": "大量MP/SP/特殊材料", "标签": ["智力", "炼金", "仪式", "功能"], "效果": { "唯一印记": "此仪式可对物品和生物使用，但同一目标最多只能接受一次嬗变。", "物之嬗变": "消耗分别象征地、水、气、火四种元素的同品质物品作为祭品，可指定另一个同级的物品的品质必定提升一级（但不能超过仪式发起者的层级）。物品的词条效果将重新生成，以符合新的品质，并且有较低几率（d20 ≤ 4）获得一个全新的词条。", "生之嬗变": "对生物使用时，可选择达成以下两种效果之一：生命跃迁】: 有中等几率（d20 ≤ 11）令仪式接受者的生命层级提升一级（不超过仪式发起者的层级），但其未来的【要素】、【权能】和【法则】将被锁定为物质或元素相关类别。若仪式失败，目标将陷入身体与灵魂的双重破损状态。", "要素嫁接": "有较高几率（d20 ≤ 16）用额外祭品中蕴含的要素、权能或法则，强行替换掉接受者自身拥有的同类力量。若仪式失败，高概率目标自身的力量将被随机替换为一种基础的元素或物质类，小概率导致原力量彻底消失。" }, "描述": "你触及了转化与上升的权柄。万物皆源于一，借此得以剥离凡俗的躯壳。万物皆生于一，因而可以攀得更高。" }, "直视深渊者": { "品质": "稀有", "类型": "被动", "消耗": "无", "标签": ["精神"], "效果": { "效果1": "面对深渊/外神系精神检定结果+2; 恐惧抗性+10%" }, "描述": "你凝视过深渊，而深渊没能吞噬你。" }, "物质·生体重塑": { "品质": "传说", "类型": "主动", "消耗": "动作: 5000 MP", "标签": ["智力", "单体", "治疗", "法则"], "效果": { "逆转死亡": "指定一名死亡时间不超过1小时、且躯体完整度>50%的非神性生物。对其进行一次【炼金】检定（DC = 目标等级 + 10）。若成功，目标复活并恢复50%HP/MP，获得【灵魂虚弱】状态。若失败，躯体崩溃。无法复活老死或灵魂湮灭者。对同一目标每7天限用一次。" }, "描述": "只要物质的基石还在，生命的大厦就能重建。在我的手术台上，死神也得排队。" }, "真理铸型 · 万物编码": { "品质": "神话", "类型": "被动/主动", "消耗": "少量MP (主动)", "标签": ["智力", "自身", "功能", "全领域制造"], "效果": { "全知工匠": "融合机械、炼金、生体改造三大领域。在进行任何【制造】或【解析】判定时，获得+15的法则级加值，且必定不会出现“大失败”。", "虚空铸造": "无需材料凭空具现传说及以下物品（及生物组织）且必定成功。", "生命编码": "自由编辑神话以下生物/机械结构，成功率100%。", "真理视界": "消耗少量MP，读取万物配方。" }, "描述": "这不再是制造，而是定义。我说它是什么，它就是什么。" }, "神话血脉 · 终焉龙座": { "品质": "神话", "类型": "被动/主动", "消耗": "无/8000MP", "标签": ["体质", "智力", "自身", "增益", "攻击", "范围:10", "单体"], "效果": { "不朽龙躯": "你的生命本质已超越古龙。基础HP/SP翻倍。免疫寒冷/毒素/窒息/疾病。全抗性+30%。", "法则吐息(主动)": "消耗8000MP，将魔力转化为不同形态的龙息喷吐：", "效果1": "极寒叹息: 锥形范围，造成冰霜法则伤害，威力4000，附加【绝对冻结】。", "效果2": "纯粹湮灭: 单体光束，造成无视抗性的纯魔力冲击，威力8000。", "效果3": "死星崩坏: 范围轰炸，威力5000，混合腐蚀与重力伤害，对建筑与护盾造成双倍破坏。", "龙威·君临": "非神话龙类需DC35豁免否则震慑/臣服。" }, "描述": "这世间没有龙，只有坐在王座上的你。" } }, "登神长阶": { "是否开启": true, "要素": {}, "权能": {}, "法则": { "物质": { "效果1": "被动【真理加护】所有制造/炼金检定的DC永久-10。生命值高于50%时，免疫所有物质类负面效果（如石化、变形等）", "效果2": "主动【虚空造物】制造传说及以下物品时，无需材料且必定成功。制造【神话】品质物品时，检定结果+20且必定不会大失败", "效果3": "【万象重塑】消耗[动作]与2500 MP。你可以强制修改一件不超过神话品质物品的“效果”与“词条”，使其更符合你的需求（需进行一次炼金检定）。或者，你可以临时（持续1小时）完美复刻一件你曾经解析过的任何物品", "效果4": "【主动 · 归零分解】消耗[动作]与3000 MP。对物品：将其瞬间还原为最原始的材料状态。若用于自身炼金失败时，可无损回收所有材料。对生物：指定非神性生物释放时视为进行一次炼金检定。若失败，造成威力6000的【真实】伤害。若成功或者目标生命值低于20%，则直接触发【即死】效果，将其肉体分解为基本粒子。" } }, "神位": "2222啊大大", "神国": { "名称": "撒法", "描述": "收购法" } } };